// ============================================================================
// Error strings
// ----------------------------------------------------------------------------
"ERROR_BOOTVOL" = " يجب تثبيت هذا البرنامج على وحدة التخزين بدء التشغيل";
"ERROR_INSTALL" = "هذا البارتشن لايفى بمتطلبات هذا التحديث ٫";

"Newer_Package_Installed_message" = "تم بالفعل تثبيت اصدار احدث من هذا البرنامج";
"Intel_Mac_message" = "لا يمكن تثبيت هذا البرنامج على هذا الكمبيوتر";


// ============================================================================
// Install Type
// ----------------------------------------------------------------------------
"InstallType_title" = "نوع التثبيت";
"InstallType_description" = "اختار ما بين تثبيت جديد او تحديث القديم";

"New_title" = "تثبيت جديد";
"New_description" = " خد نسخة احتياطية من مجلد الاكسترا ان وجد فى البارتشن المختار فسوف يتم انشاء واحد جديد لو قمت باختيار اى من الخيارات فى البرنامج غير البوت لودر";

"Upgrade_title" = "تحديث";
"Upgrade_description" = "سوف يتم دمج اى خيار انت تختاره الى الخيارات المضافة بالفعل فى فولدر الاكسترا فى البارتشن المختار التثبيت عليه";

// ============================================================================
// Bootloader
// ----------------------------------------------------------------------------
"Chameleon_title" = "Chameleon Bootloader";
"Chameleon_description" = "البوت لودر يحتاج اللى ثلاث ملفات (باختصار )
boot0 (On the drive's MBR) responsible for loading boot1.
boot1 (On the partition's boot-sector) to finding boot2.
boot2 (On the partition's root directory) for loading kernel etc.";

"Standard_title" = "Standard";
"Standard_description" = "Install Chameleon's files to the root of the selected partition using either boot0 or boot0md depending on your system without destroying any existing Windows installation if you have one.";

"EFI_title" = "EFI";
"EFI_description" = "Install Chameleon's files to the normally hidden EFI system partition using either boot0 or boot0md depending on your system and without destroying any existing Windows installation if you have one.";

"noboot_title" = "Don't install the Bootloader";
"noboot_description" = "مفيد اذا كنت تريد فقط تتبيت الاكسترا";


// ============================================================================
// Modules
// ----------------------------------------------------------------------------
"Module_title" = "Modules";
"Module_description" = "يسمح هذا النظام الجديد باضافة وظائف جديد للبوت لودر دون الحاجة لتغير ملف البوت كاملا ";

"klibc_title" = "klibc";
"klibc_description" = "This module provides a standard c library for modules to link to if the library provided by chameleon is insufficient.
This is currently only used by the uClibc++ library.
Source: http://www.kernel.org/pub/linux/libs/klibc/";

"AutoReso_title" = "Resolution";
"AutoReso_description" = "هذه الاضافة تقرا معلومات الشاشة الاساسية المتصلة بالجهاز
هذه الاضافة غير مدمجه فى trunk الى الان  و لها استخدام بسيط
بالاضفة فانها تقوم بالتعديل على vesa mode  لكروت الشاشة انتل لتحصل على رزليوشن شاشتك اثناء الاقلاع";

"uClibc_title" = "uClibc++";
"uClibc_description" = "This module provides a minimalistic c++ runtime library for use in other modules.
This does not provide functionality by itself, instead it is used to allow for the c++ language to be used in other modules.
Please note that rtti and exceptions has both been disabled.
Source: http://cxx.uclibc.org/
Dependencies: klibc";

"Keylayout_title" = "Keylayout";
"Keylayout_description" = "This module permits the user to define the keyboard key mappings.";


// ============================================================================
// Utility
// These are currently unused!!!
// ----------------------------------------------------------------------------
"Utility_title" = "Utilities";
"Utility_description" = "Optional files to help setup";

"PrefPanel_title" = "Preference Panel";
"PrefPanel_description" = "Installs Preference Panel for Chameleon.";

"SMBIOS_title" = "SMBIOS.plist";
"SMBIOS_description" = "Copies an example smbios.plist in /Extra/Configuration.";

"Documentation_title" = "Documentation";
"Documentation_description" = "Documentation for Chameleon manual install and use";


// ============================================================================
// Boot Options - The follow options are split to match the layout OptionalSettings text files.
// but they can be changed to suit however anyone wants to do it.
// ----------------------------------------------------------------------------

"Options_title" = "Settings";
"Options_description" = "بواسطة اختيار اى من  هذه الخيارات /Extra/org.chameleon.Boot.plist انشى";

"BootBanner_title" = "BootBanner=No";
"BootBanner_description" = "العاء اى كتبات تظهر فى واجهه البوت مثل رقم نسخة البوت";

"GUI_title" = "GUI=No";
"GUI_description" = "الغاء الواجهه الرسومية للبوت";

"LegacyLogo_title" = "LegacyLogo=Yes";
"LegacyLogo_description" = "استخدام لوجو شركة ابل الاصلى اثناء بدء التشغيل بدلا من المعدل الذى ياتى مع الثيم";

"InstantMenu_title" = "InstantMenu=Yes";
"InstantMenu_description" = "By default, when Chameleon loads you'll see the icon for the current default partition, along with a timeout progress bar which left alone will count down before Chameleon automatically boots that partition. This options skips that and takes you directly to the device selection screen.";

"QuietBoot_title" = "QuietBoot=Yes";
"QuietBoot_description" = "Enable quiet boot mode (no messages or prompt).";

"ShowInfo_title" = "ShowInfo=Yes";
"ShowInfo_description" = "Enables display of partition and resolution details shown on the left side of the GUI under the boot banner. This is useful information for troubleshooting, though can clash with certain themes.";

"Wait_title" = "Wait=Yes";
"Wait_description" = "يوقف التوبيت بعد ما ان يقوم الشاميلون بعملياته مفيد لو واجهك مشاكل من البوت لودر ٫";

// ----------------------------------------------------------------------------

"arch_title" = "arch=i386";
"arch_description" = "Boots the kernel in 32bit mode rather than the default 64bit mode.";

"EHCIacquire_title" = "EHCIacquire=Yes";
"EHCIacquire_description" = "Enables the option to fix any EHCI ownership issues due to bad bioses.";

"EthernetBuiltIn_title" = "EthernetBuiltIn=Yes";
"EthernetBuiltIn_description" = "Enables the option of adding 'built-in' to your ethernet devices.";

"ForceHPET_title" = "ForceHPET=Yes";
"ForceHPET_description" = "Enables HPET on intel chipsets, for bioses that dont include the option.";

"ForceWake_title" = "ForceWake=Yes";
"ForceWake_description" = "This option enables you to bypass bad sleep images.";

"RestartFix_title" = "RestartFix=No";
"RestartFix_description" = "Disables the automatically enabled restart fix.";

"UHCIreset_title" = "UHCIreset=Yes";
"UHCIreset_description" = "Enables the option to reset UHCI controllers before starting OS X.";

"UseMemDetect_title" = "UseMemDetect=No";
"UseMemDetect_description" = "Disables the automatically enabled RAM recognition.";

"UseKernelCache_title" = "UseKernelCache=Yes";
"UseKernelCache_description" = "For Lion only. Enables loading of the pre-linked kernel. This will ignore /E/E and /S/L/E. ONLY use this is you have know it contains everything you need.";

"Wake_title" = "Wake=Yes";
"Wake_description" = "Attempts to load the sleep image saved from last hibernation.";

// ----------------------------------------------------------------------------

"CSTUsingSystemIO_title" = "Generate C-States=Yes";
"CSTUsingSystemIO_description" = "New C-State _CST generation method using SystemIO registers instead of FixedHW.";

"DropSSDT_title" = "DropSSDT=Yes";
"DropSSDT_description" = "Discard the motherboard's built-in SSDT tables.";

"EnableC2State_title" = "EnableC2State=Yes";
"EnableC2State_description" = "Enable specific Processor power state, C2.";

"EnableC3State_title" = "EnableC3State=Yes";
"EnableC3State_description" = "Enable specific Processor power state, C3.";

"EnableC4State_title" = "EnableC4State=Yes";
"EnableC4State_description" = "Enable specific Processor power state, C4.";

"GenerateCStates_title" = "Generate C-States=Yes";
"GenerateCStates_description" = "Enable auto generation of processor idle sleep states (C-States).";

"GeneratePStates_title" = "Generate P-States=Yes";
"GeneratePStates_description" = "Enable auto generation of processor power performance states (P-States).";

// ----------------------------------------------------------------------------

"1024x600x32_title" = "1024x600x32";
"1024x600x32_description" = "Set Graphics Mode to 1024x600x32";

"1024x768x32_title" = "1024x768x32";
"1024x768x32_description" = "Set Graphics Mode to 1024x768x32";

"1280x768x32_title" = "1280x768x32";
"1280x768x32_description" = "Set Graphics Mode to 1280x768x32";

"1280x800x32_title" = "1280x800x32";
"1280x800x32_description" = "Set Graphics Mode to 1280x800x32";

"1280x1024x32_title" = "1280x1024x32";
"1280x1024x32_description" = "Set Graphics Mode to 1280x1024x32";

"1280x960x32_title" = "1280x960x32";
"1280x960x32_description" = "Set Graphics Mode to 1280x960x32";

"1440x900x32_title" = "1440x900x32";
"1440x900x32_description" = "Set Graphics Mode to 1440x900x32";

"1600x900x32_title" = "1600x900x32";
"1600x900x32_description" = "Set Graphics Mode to 1600x900x32";

"1680x1050x32_title" = "1680x1050x32";
"1680x1050x32_description" = "Set Graphics Mode to 1680x1050x32";

"1920x1080x32_title" = "1920x1080x32";
"1920x1080x32_description" = "Set Graphics Mode to 1920x1080x32";

"1920x1200x32_title" = "1920x1200x32";
"1920x1200x32_description" = "Set Graphics Mode to 1920x1200x32";

// ----------------------------------------------------------------------------

"GraphicsEnabler_title" = "GraphicsEnabler=Yes";
"GraphicsEnabler_description" = "Enables the option to autodetect NVIDIA based GPUs and inject the correct info.";

"UseAtiROM_title" = "UseAtiROM=Yes";
"UseAtiROM_description" = "Enables UseAtiROM options.";

"UseNvidiaROM_title" = "UseNvidiaROM=Yes";
"UseNvidiaROM_description" = "Enables UseNvidiaROM options.";

"VBIOS_title" = "VBIOS=Yes";
"VBIOS_description" = "Enables VBIOS option";

// ----------------------------------------------------------------------------
// Boot options - KERNEL FLAGS
// ----------------------------------------------------------------------------

"Verbose_title" = "Verbose Mode";
"Verbose_description" = "Turns on verbose logging and allows you to see messages from both Chameleon and the OS X kernel at boot time. Essential for troubleshooting.";

"Singleusermode_title" = "Single User Mode";
"Singleusermode_description" = "A troubleshooting option used for booting into OS X's BSD/Unix command line.";

"Ignorecaches_title" = "Ignore Caches";
"Ignorecaches_description" = "Not an option that's needed for everyday booting, but it can be useful if you want OS X to load all files from it's system folders, rather than relying on it's pre-built caches.";

"Npci_title" = "npci=0x2000";
"Npci_description" = "For overcoming a hang at 'PCI configuration begin' on some systems. 0x2000 is the kIOPCIConfiguratorPFM64 flag, as seen in the IOPCIFamily source code.";

"Darkwake_title" = "darkwake=0";
"Darkwake_description" = "Lion only. Disables the 'low power wake' feature which can sometimes leave the screen black after wake from sleep.";


// ----------------------------------------------------------------------------
// Boot options - KEYLAYOUTS
// ----------------------------------------------------------------------------

"mac-de_title" = "German Mac Keyboard";
"mac-de_description" = "Use the keyboard layout for a German Mac keyboard";

"mac-es_title" = "Spanish Mac Keyboard";
"mac-es_description" = "Use the keyboard layout for a Spanish Mac keyboard";

"mac-fr_title" = "French Mac Keyboard";
"mac-fr_description" = "Use the keyboard layout for a French Mac keyboard";

"mac-it_title" = "Italian Mac Keyboard";
"mac-it_description" = "Use the keyboard layout for an Italian Mac keyboard";

"mac-se_title" = "Swedish Mac Keyboard";
"mac-se_description" = "Use the keyboard layout for a Swedish Mac keyboard";

"pc-fr_title" = "French PC Keyboard";
"pc-fr_description" = "Use the keyboard layout for a French PC keyboard";


// ----------------------------------------------------------------------------
// Boot options - THEMES
// ----------------------------------------------------------------------------

"Embed_title" = "Embed";
"Embed_description" = "A smaller simple version of the new default theme used when building a version of Chameleon which requires an embedded theme.";

"Legacy_title" = "Legacy";
"Legacy_description" = "Chameleon's original default theme introduced for v2.0 RC1";

"Default_title" = "Standard";
"Default_description" = "Chameleon default theme introduced for v2.0 RC5";

"Bullet_title" = "Bullet";
"Bullet_description" = "A lovely simple theme by NoSmokingBandit from April 2009.";


// ============================================================================
// The filenames from OptionalSettings text files' become sub menu headings.
// These sub menu headings need titles and descriptions.
// ----------------------------------------------------------------------------
// Control

"Control_title" = "Control Options";
"Control_description" = "Settings to control how Chameleon works.";

// General
"General_title" = "General Options";
"General_description" = "Choose from a selection of base options.";

// KernelFlags
"KernelFlags_title" = "Kernel Flags";
"KernelFlags_description" = "Choose from a selection of kernel flags.";

// PowerManagement
"PowerManagement_title" = "Power Management";
"PowerManagement_description" = "A selection of options that deal with power management and speedstep.";

// Resolution
"Resolution_title" = "Resolution";
"Resolution_description" = "Set one resolution to use, or select 'None' if you don't want to select a resolution.";

// Video
"Video_title" = "Video";
"Video_description" = "A selection of options that deal with video.";

// KeyLayout
"KeyLayout_title" = "KeyLayout";
"KeyLayout_description" = "Set one keylayout to use, or select 'None' if you don't want to select a keylayout.";

// Themes
"Themes_title" = "Themes";
"Themes_description" = "A collection of sample themes
More themes can be found at http://forum.voodooprojects.org/index.php/board,7.0.html";


// ============================================================================
// Exclusive boot options string - These are added automatically by buildpkg
// Name to be used should be ChooseNone-xxxxxx
// Where xxxxx = the name of the BootOptions file (minus the .txt)
// ----------------------------------------------------------------------------
"ChooseNone-Resolution_title" = "None";
"ChooseNone-Resolution_description" = "Don't choose a resolution.";

"ChooseNone-keylayout_title" = "None";
"ChooseNone-keylayout_description" = "Don't choose a keylayout.";
